Tekla Open API Reference for Tekla Structures 2025
ModelAccess.ConnectToModel Method
 Gets a model connnection.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static Model ConnectToModel()
Public Shared Function ConnectToModel As Model
Return Value
Type: Model
The model or null if unable to connect.
See Also
Reference
ModelAccess Class
ConnectToModel Overload
Tekla.Structures.Dialog.UIControls Namespace